/*!*************************************************************************** *
 * \file        NV_UserPage.h
 * \brief       MLX8133x/4x NVRAM User Page handling
 *
 * \note        project MLX8133x/4x
 *
 * \author      Marcel Braat
 *
 * \date        2017-08-23
 *
 * \version     2.0
 *
 *
 * \copyright   MELEXIS Microelectronic Integrated Systems
 *
 * Copyright (C) 2017-2024 Melexis N.V.
 * The Software is being delivered 'AS IS' and Melexis, whether explicitly or
 * implicitly, makes no warranty as to its Use or performance.
 * The user accepts the Melexis Firmware License Agreement.
 *
 * Melexis confidential & proprietary
 *
 * Non Volatile Memory Map:
 *
 * WordIdx  ByteIdx Size    Description
 *                   32     PATCH_HDR (Keep together with PATCH_CODE as one block (HEX))
 *   000    0x0000          Patch header & code CRC (LSB) and patch code size (MSB)
 *   001    0x0002          Patch ID and version field
 *   002    0x0004          Patch 0 Data/Instruction
 *   003    0x0006          Patch 1 Data/Instruction
 *   004    0x0008          Patch 2 Data/Instruction
 *   005    0x000A          Patch 3 Data/Instruction
 *   006    0x000C          Patch 0 Address[15:0]
 *   007    0x000E          Patch 0 Address[19:16] & Control
 *   008    0x0010          Patch 1 Address[15:0]
 *   009    0x0012          Patch 1 Address[19:16] & Control
 *   010    0x0014          Patch 2 Address[15:0]
 *   011    0x0016          Patch 2 Address[19:16] & Control

/* #define C_NV_USER_REV     0x03U */                                           /*!< Non Volatile Memory User Layout Version ID (9-bit speeds-base + 3-bits exponent) */
#if (_SUPPORT_RSHUNT < 3) && (C_NV_CURR_DIV > 4)                                /* Up to 64A */
#define C_MULTIPLIER_OFF     5U                                                 /*!< Motor current 32x, 64x, 128x or 256x (up to 65A) */
#elif (_SUPPORT_RSHUNT < 6) && (C_NV_CURR_DIV > 3)                              /* Up to 32A */
#define C_MULTIPLIER_OFF     4U                                                 /*!< Motor current 16x, 32x, 64x or 128x (up to 32A) */
#elif (_SUPPORT_RSHUNT < 12) && (C_NV_CURR_DIV > 2)                             /* Up to 16A */
#define C_MULTIPLIER_OFF     3U                                                 /*!< Motor current 8x, 16x, 32x or 64x (up to 16A) */
#elif (_SUPPORT_RSHUNT < 25) && (C_NV_CURR_DIV > 1)                             /* Up to 8A */
#define C_MULTIPLIER_OFF     2U                                                 /*!< Motor current 4x, 8x, 16x or 32x (up to 8A) */
#elif (_SUPPORT_RSHUNT < 50) && (C_NV_CURR_DIV > 0)                             /* Up to 4A */
#define C_MULTIPLIER_OFF     1U                                                 /*!< Motor current 2x, 4x, 8x or 16x (up to 4A) */
#else  /* _SUPPORT_RSHUNT */
#define C_MULTIPLIER_OFF     0U                                                 /*!< Motor current 1x, 2x, 4x or 8x (up to 2A) */
#endif /* _SUPPORT_RSHUNT */
#endif

/* USER AREA:
 *  1) HEADER:            1 block  of 64-bits ( 4x 16-bits words) -    0 bits unused ( 0.0%)
 * 2a) STD_LIN_PARAMS:    2 blocks of 64-bits ( 8x 16-bits words) -  2x4 bits unused ( 6.25%) (MLX81339: Not used)
 * 2b) ENH_LIN_PARAMS:    2 blocks of 64-bits ( 8x 16-bits words) - 2x16 bits unused (25.0%) (MLX81339: Not used)
 * 2c) UDS_LIN_PARAMS:    8 blocks of 64-bits (32x 16-bits words) -   48 bits unused ( 9.375%) (MLX81339: Not used)
 *  3) APP_EOL:           1 blocks of 64-bits ( 4x 16-bits words) -    4 bits unused ( 6.25%)
 *  4) APP_PARAMS:        1 block  of 64-bits ( 4x 16-bits words) -    0 bits unused ( 0.0%)
 *  5) ACT_PARAMS:        4 blocks of 64-bits (16x 16-bits words) -    0 bits unused ( 0.0%) (Others)
 *  5) ACT_PARAMS:        5 blocks of 64-bits (20x 16-bits words) -   19 bits unused ( 0.0%) (MLX81339 only
 *  6) SENSOR_PARAMS:     1 block  of 64-bits ( 4x 16-bits words) -    4 bits unused ( 6.25%)
 *  7) ACT_STALL:         1 block  of 64-bits ( 4x 16-bits words) -    2 bits unused ( 3.125%)
 *  8) APP_LOG:           2 blocks of 64-bits ( 8x 16-bits words) -    0 bits unused ( 0.0%)
 *  9) STD_I2C_PARAMS:    1 block  of 64-bits ( 4x 16-bits words) -   48 bits unused (75.0%)
 * 10) STD_CAN_PARAMS:    2 blocks of 64-bits ( 4x 16-bits words) -   32 bits unused (25.0%)
 * 11) EACT_PARAMS:       2 blocks of 64-bits ( 4x 16-bits words) -   51 bits unused (39.8%)
 * TOTAL:             21-22 blocks of 64-bits (92x 16-bits words) -
 *
 * MLX81339:             10x8 bytes = 80 Bytes (1 Block of 128By)
 */
/*! 1) HEADER: 1 block  of 64-bits (4x 16-bits words) */
typedef struct
{
    uint16_t u8CRC8                   : 8;                                      /**< 0x00: CRC-8 */
    uint16_t u8Revision               : 8;                                      /**< 0x01: Non Volatile Memory Structure revision */
    uint16_t u16ConfigurationID;                                                /**< 0x02: Configuration ID */
    uint16_t u12StructIDs             : 14;                                     /**< 0x04: Structure ID's */
#define C_HEADER_PARAMS                 (1U << 0)                               /*!< Bit 0: Header Parameters ID */
#if (LIN_COMM != FALSE)
#define C_STD_LIN_PARAMS                (1U << 1)                               /*!< Bit 1: Standard LIN  Parameters ID */
#if (LINPROT == LIN2X_HVAC52)
#define C_ENH_LIN_PARAMS                (1U << 2)                               /*!< Bit 2: Enhanced LIN Parameters ID */
#else  /* (LINPROT == LIN2X_HVAC52) */
#define C_ENH_LIN_PARAMS                (0U << 2)                               /*!< Bit 2: Enhanced LIN Parameters ID */
#endif /* (LINPROT == LIN2X_HVAC52) */
#if (_SUPPORT_UDS != FALSE)
#define C_UDS_LIN_PARAMS                (1U << 3)                               /*!< Bit 3: UDS LIN Parameters ID */
#else  /* (_SUPPORT_UDS != FALSE) */
#define C_UDS_LIN_PARAMS                (0U << 3)                               /*!< Bit 3: UDS LIN Parameters ID */
#endif /* (_SUPPORT_UDS != FALSE) */
#else  /* (LIN_COMM != FALSE) */
#define C_STD_LIN_PARAMS                (0U << 1)                               /*!< Bit 1: Standard LIN  Parameters ID */
#define C_ENH_LIN_PARAMS                (0U << 2)                               /*!< Bit 2: Enhanced LIN Parameters ID */
#define C_UDS_LIN_PARAMS                (0U << 3)                               /*!< Bit 3: UDS LIN Parameters ID */
#endif /* (LIN_COMM != FALSE) */
#define C_APP_EOL                       (1U << 4)                               /*!< Bit 4: End-of-Line ID */
#if (_SUPPORT_APP_SAVE != FALSE)
#define C_APP_STORE                     (1U << 5)                               /*!< Bit 5: Application Storage ID */
#else  /* (_SUPPORT_APP_SAVE != FALSE) */
#define C_APP_STORE                     (0U << 5)                               /*!< Bit 5: Application Storage ID */
#endif /* (_SUPPORT_APP_SAVE != FALSE) */
#define C_ACT_PARAMS                    (1U << 6)                               /*!< Bit 6: Actuator Parameters ID */
#if (_SUPPORT_TRIAXIS_MLX90363 != FALSE) || (_SUPPORT_TRIAXIS_MLX9038x != FALSE) || \
    (_SUPPORT_TRIAXIS_MLX90367 != FALSE) || (_SUPPORT_TRIAXIS_MLX90372 != FALSE) || \
    (_SUPPORT_TRIAXIS_MLX90377 != FALSE) || (_SUPPORT_TRIAXIS_MLX90395 != FALSE) || \
    (_SUPPORT_TRIAXIS_MLX90421 != FALSE) || (_SUPPORT_TRIAXIS_MLX90422 != FALSE) || \
    (_SUPPORT_TRIAXIS_MLX90425 != FALSE) || (_SUPPORT_TRIAXIS_MLX90426 != FALSE) || \
    (_SUPPORT_TRIAXIS_MLX90427 != FALSE) || \
    (_SUPPORT_INDUCTIVE_POS_SENSOR_MLX90513 != FALSE) || \
    (_SUPPORT_DUAL_HALL_LATCH_MLX92251 != FALSE) || (_SUPPORT_DUAL_HALL_LATCH_MLX92255 != FALSE) || \
    (_SUPPORT_FOC_MODE != FOC_MODE_NONE)
#define C_SENSOR_PARAMS                 (1U << 7)                               /*!< Bit 7: Sensor Parameters ID */
#else  /* (_SUPPORT_TRIAXIS_MLX90363 != FALSE) || (_SUPPORT_TRIAXIS_MLX9038x != FALSE) || \
        * (_SUPPORT_TRIAXIS_MLX90367 != FALSE) || (_SUPPORT_TRIAXIS_MLX90372 != FALSE) || \
        * (_SUPPORT_TRIAXIS_MLX90377 != FALSE) || (_SUPPORT_TRIAXIS_MLX90395 != FALSE) || \
        * (_SUPPORT_TRIAXIS_MLX90421 != FALSE) || (_SUPPORT_TRIAXIS_MLX90422 != FALSE) || \
        * (_SUPPORT_TRIAXIS_MLX90425 != FALSE) || (_SUPPORT_TRIAXIS_MLX90426 != FALSE) || \
        * (_SUPPORT_TRIAXIS_MLX90427 != FALSE) || \
        * (_SUPPORT_INDUCTIVE_POS_SENSOR_MLX90513 != FALSE) || \
        * (_SUPPORT_DUAL_HALL_LATCH_MLX92251 != FALSE) || (_SUPPORT_DUAL_HALL_LATCH_MLX92255 != FALSE) || \
        * (_SUPPORT_FOC_MODE != FOC_MODE_NONE) */
#define C_SENSOR_PARAMS                 (0U << 7)                               /*!< Bit 7: Sensor Parameters ID */
#endif /* (_SUPPORT_TRIAXIS_MLX90363 != FALSE) || (_SUPPORT_TRIAXIS_MLX9038x != FALSE) || \
        * (_SUPPORT_TRIAXIS_MLX90367 != FALSE) || (_SUPPORT_TRIAXIS_MLX90372 != FALSE) || \
        * (_SUPPORT_TRIAXIS_MLX90377 != FALSE) || (_SUPPORT_TRIAXIS_MLX90395 != FALSE) || \
        * (_SUPPORT_TRIAXIS_MLX90421 != FALSE) || (_SUPPORT_TRIAXIS_MLX90422 != FALSE) || \
        * (_SUPPORT_TRIAXIS_MLX90425 != FALSE) || (_SUPPORT_TRIAXIS_MLX90426 != FALSE) || \
        * (_SUPPORT_TRIAXIS_MLX90427 != FALSE) || \
        * (_SUPPORT_INDUCTIVE_POS_SENSOR_MLX90513 != FALSE) || \
        * (_SUPPORT_DUAL_HALL_LATCH_MLX92251 != FALSE) || (_SUPPORT_DUAL_HALL_LATCH_MLX92255 != FALSE) || \
        * (_SUPPORT_FOC_MODE != FOC_MODE_NONE) */
#define C_ACT_STALL                     (1U << 8)                               /*!< Bit 8: Actuator Stall Parameters ID */
#if (_SUPPORT_NV_LOG_ERROR != FALSE)
#define C_APP_ERROR_LOG                 (1U << 9)                               /*!< Bit 9: Application Error Log ID */
#else  /* (_SUPPORT_NV_LOG_ERROR != FALSE) */
#define C_APP_ERROR_LOG                 (0U << 9)                               /*!< Bit 9: Application Error Log ID */
#endif /* (_SUPPORT_NV_LOG_ERROR != FALSE) */
#if (I2C_COMM != FALSE)
#define C_I2C_PARAMS                    (1U << 10)                              /*!< Bit 10: I2C parameters bit-ID */
#else  /* (I2C_COMM != FALSE) */
#define C_I2C_PARAMS                    (0U << 10)                              /*!< Bit 10: I2C parameters bit-ID */
#endif /* (I2C_COMM != FALSE) */
#if (CAN_COMM != FALSE)
#define C_CAN_PARAMS                    (1U << 11)                              /*!< Bit 11: CAN parameters bit-ID */
#else  /* (CAN_COMM != FALSE) */
#define C_CAN_PARAMS                    (0U << 11)                              /*!< Bit 11: CAN parameters bit-ID */
#endif /* (CAN_COMM != FALSE) */
#define C_RES1_PARAMS                   (0U << 12)                              /*!< Bit 12: Reserved 1 parameters bit-ID */
#define C_RES2_PARAMS                   (0U << 13)                              /*!< Bit 13: Reserved 2 parameters bit-ID */
    uint16_t u2WriteCycleCountMSW     : 2;                                      /**< 0x05: Write Cycle Count MSW */
    uint16_t u16WriteCycleCountLSW;                                             /**< 0x06: Write Cycle Count LSW */
} HEADER_t;

#if (LIN_COMM != FALSE)
/*! 2a) STD_LIN_PARAMS_t: 1 block of 64-bits of Standard LIN parameters (in-car programming) */
typedef struct
{
    uint16_t u8CRC8                   : 8;                                      /**< 0x00: CRC8 */
    uint16_t u3LinUV                  : 3;                                      /**< 0x01.[2:0]: LIN UV threshold */
    uint16_t u1BusTimeOutSleep        : 1;                                      /**< 0x01.[3]: Bus-TimeOut Sleep */
    uint16_t u4Reserved               : 4;                                      /**< 0x01.[7:4]: Reserved */
    uint16_t u8NAD                    : 8;                                      /**< 0x02: Node Address (W:B5) */
    uint16_t u8ControlFrameID         : 8;                                      /**< 0x03: Control-message Frame-ID (R:B2-10/W:B7) */
    uint16_t u8StatusFrameID          : 8;                                      /**< 0x04: Status-message Frame-ID (R:B2-11/W:B7) */
    uint16_t u8Variant                : 8;                                      /**< 0x05: Product Reference (R:B2-00/W:B4) */
    uint16_t u8HardwareID             : 8;                                      /**< 0x06: Hardware ID (R:B2-xx/W:B4) */
#if (LINPROT != LIN2X_AIRVENT12)
    uint16_t u8SoftwareID             : 8;                                      /**< 0x07: Software ID (R:B2-xx/W:B4) */
#else  /* (LINPROT != LIN2X_AIRVENT12) */
    uint16_t u8Status2FrameID         : 8;                                      /**< 0x07: Status2-message Frame-ID (R:B2-12/W:B7) */
#endif /* (LINPROT != LIN2X_AIRVENT12) */
} STD_LIN_PARAMS_t;

#if (LINPROT == LIN2X_HVAC52)
/*! 2b) ENH_LIN_PARAMS_t: 1 block of 64-bits of Enhanced LIN parameters (in-car programming) */
typedef struct
{
    uint16_t u8CRC8                   : 8;                                      /**< 0x00: CRC8 */
    uint16_t u8LINAA_EShunt           : 8;                                      /**< 0x01: LIN-AA External shunt */
    uint16_t u16FunctionID;                                                     /**< 0x02: Function ID */
    uint16_t u8GAD                    : 8;                                      /**< 0x04: Group Address */
    uint16_t u8GroupControlFrameID    : 8;                                      /**< 0x05: Group Control-message Frame-ID */
    uint16_t u16Reserved;                                                       /**< 0x06: Reserved */
} ENH_LIN_PARAMS_t;
#endif /* (LINPROT != LIN2X_HVAC52) */

#if (_SUPPORT_UDS != FALSE)
/*! UDS String Pack structure; Note: This UDS String implementation does not support ASCII 0x60..0x7F, which includes: a-z. */
typedef struct _PCKCHR
{
    uint8_t u6Char1 : 6;                                                        /**< ASCII 0x20..0x5F: ' ' .. '_' --> 0x00..0x3F */
    uint8_t u6Char2 : 6;                                                        /**< ASCII 0x20..0x5F: ' ' .. '_' --> 0x00..0x3F */
    uint8_t u6Char3 : 6;                                                        /**< ASCII 0x20..0x5F: ' ' .. '_' --> 0x00..0x3F */
    uint8_t u6Char4 : 6;                                                        /**< ASCII 0x20..0x5F: ' ' .. '_' --> 0x00..0x3F */
} __attribute__((packed)) PCKCHR_t;

/*! 2c) UDS_LIN_PARAMS_t: 8 blocks of 64-bits (32x 16-bits words) (Example) */
typedef struct
{
    uint16_t u8CRC8                   : 8;                                      /**< 0x00: CRC8 */
    uint16_t u8Reserved               : 8;                                      /**< 0x01: Reserved */
#if (_SUPPORT_UDS_DK >= _SUPPORT_UDS_DK4)
    uint16_t u16UDS_SubSystemID;                                                /**< 0x02: UDS Sub-System ID */
#else /* (_SUPPORT_UDS_DK >= _SUPPORT_UDS_DK4) */
    uint16_t UDS_Reserved;                                                      /**< 0x02: Reserved for UDS Sub-System ID */
#endif /* (_SUPPORT_UDS_DK >= _SUPPORT_UDS_DK4) */
    uint16_t UDS_FazitProductionDate;                                           /**< 0x04: Production Date Tier 1: [15:9] Year (00-99), [8:5] Month (1-12), [4:0] Day (1-31) (0x6E00-0x6FFF) */
    uint16_t UDS_FazitEOLNumber;                                                /**< 0x06: EOL Number Fazit (4 digits-BCD) (0x6E00-0x6FFF) */
    uint16_t UDS_FazitManufacturerNumber;                                       /**< 0x08: Manufacturer Number Fazit (4 digits-BCD) (0x6E00-0x6FFF) */
    PCKCHR_t UDS_SystemName[3];                                                 /**< 0x0A-0x12: UDS System Name [11:0] (0x6C00-0x6DFF) */
    uint8_t UDS_SystemName_12;                                                  /**< 0x13: UDS System Name [12] (0x6C00-0x6DFF) */
    PCKCHR_t UDS_SerialNumber[5];                                               /**< 0x14-0x22: UDS Serial-number[20] (0x6A00-0x6BFF) */
    uint8_t UDS_HwVersion_LSB;                                                  /**< 0x23: UDS Hardware version (LSB) (0x6800-0x69FF) */
    uint8_t UDS_HwVersion_MSB;                                                  /**< 0x24: UDS Hardware version (MSB) (0x6800-0x69FF) */
    uint8_t UDS_HwVersion_XSB;                                                  /**< 0x25: UDS Hardware version (XSB) (0x6800-0x69FF) */
    PCKCHR_t UDS_HardwareNumber[3];                                             /**< 0x26-0x2E: UDS Hardware number[11] (0x6600-0x67FF) */
    PCKCHR_t UDS_SwVersion[1];                                                  /**< 0x2F-0x31: UDS Software Version[4] (0x6400-0x65FF) */
    PCKCHR_t UDS_SparePartNumber[3];                                            /**< 0x32-0x3A: UDS Spare part number[11] (0x6200-0x63FF) */
    uint8_t UDS_ReservedB;                                                      /**< 0x3B: Reserved */
    uint16_t u16Reserved[2];                                                    /**< 0x3C-0x3F: Reserved */
} UDS_LIN_PARAMS_t;
#endif /* (_SUPPORT_UDS != FALSE) */
#endif /* (LIN_COMM != FALSE) */

/*! 3) APP_EOL: 1 block of 64-bits (12x 16-bits words) */
typedef struct
{
    uint16_t u8CRC8                   : 8;                                      /**< 0x00: CRC8 */
    uint16_t u7EmergencyRunPos        : 7;                                      /**< 0x01.[6:0]: Emergency/Safety position (0-100%) */
    uint16_t u1EmergencyRunPosEna     : 1;                                      /**< 0x01.[7]: Emergency/Safety position Disable/Enable */
    uint16_t u1MotorDirectionCCW      : 1;                                      /**< 0x02.[0]: Motor rotational direction: 0=CW, 1=CCW */
#define C_MOTOR_ROTATION_CW         0U                                          /*!< Motor rotational Direction: Clock Wise */
#define C_MOTOR_ROTATION_CCW        1U                                          /*!< Motor rotational Direction: Counter Clock Wise */
    uint16_t u1StallDetectorEna       : 1;                                      /**< 0x02.[1]: Stall-detector: 0=Disabled, 1=Enabled */
#define C_STALLDET_DIS              0U                                          /*!< Stall-Detector: Disabled */
#define C_STALLDET_ENA              1U                                          /*!< Stall-Detector: Enabled */
    uint16_t u1RealTravelSaved        : 1;                                      /**< 0x02.[2]: Travel Saved */
    uint16_t u1PorCalibration         : 1;                                      /**< 0x02.[3]: Power-on calibration */
    uint16_t u4Reserved_2             : 4;                                      /**< 0x02.[7:4]: Reserved */
#if FALSE
    uint16_t u2DefaultSpeed           : 2;                                      /**< 0x02.[5:4]: Motor default Speed mode */
    #define C_DEFSPEEDMODE_AUTO         0U
    #define C_DEFSPEEDMODE_1            1U
    #define C_DEFSPEEDMODE_2            2U
    #define C_DEFSPEEDMODE_3            3U
    uint16_t u2DefaultTorque          : 2;                                      /**< 0x02.[7:6]: Motor default Torque level */
    #define C_DEFTORQUELEVEL_NORMAL     0U
    #define C_DEFTORQUELEVEL_LOW        1U
    #define C_DEFTORQUELEVEL_HIGH       2U
    #define C_DEFTORQUELEVEL_MAX        3U
#endif
    uint16_t u8EndStopTime            : 8;                                      /**< 0x03: End-stop pause time */
    uint16_t u16RealTravel;                                                     /**< 0x04: Real Travel */
    uint16_t u8TravelToleranceLo      : 8;                                      /**< 0x06: Default Travel Tolerance (Lower) */
    uint16_t u8TravelToleranceUp      : 8;                                      /**< 0x07: Default Travel Tolerance (Upper) */
} APP_EOL_t;

#if (_SUPPORT_APP_SAVE != FALSE)
/*! 4) APP_PARAMS: 1 blocks of 64-bits ( 4x 16-bits words) */
typedef struct
{
    uint16_t u8CRC8                    : 8;                                     /**< PARAM structure CRC8 */
    uint16_t u4PageID                  : 4;                                     /**< PARAM structure Page ID (XOR) */
    uint16_t u4WrtCntH                 : 4;                                     /**< PARAM structure write cycle counter (MSnibble) */
    uint16_t u16WrtCntL;                                                        /**< PARAM structure write cycle counter (LSW) */
    uint16_t u16ParamLSW;                                                       /**< PARAM structure Data (LSW) */
    uint16_t u16ParamMSW;                                                       /**< PARAM structure Data (MSW) */
} APP_PARAMS_t;
#endif /* (_SUPPORT_APP_SAVE != FALSE) */

/*! 5) ACT_PARAMS: 4 blocks of 64-bits (16x 16-bits words)
 *     ACT_PARAMS: 5 blocks of 64-bits (20x 16-bits words) (MLX81339 only) */
typedef struct
{
    uint16_t u8CRC8                   : 8;                                      /**< 0x00: CRC8 */
    uint16_t u8VsupRef                : 8;                                      /**< 0x01: Vsupply reference [1/8V] */
    uint16_t u12GearBoxRatio          : 12;                                     /**< 0x02 [11: 0]: Gear-box ratio, e.g. 600:1 */
    uint16_t u4PolePairs              : 4;                                      /**< 0x02.[15:12]: Number of pole-pairs + 1 (1-16) */
    uint16_t u8MotorConstant          : 8;                                      /**< 0x04: Motor Constant [mV/RPS] or [10mV/RPS] (MMP240726-2) */
    uint16_t u8MotorCoilRtot          : 8;                                      /**< 0x05: Motor coil resistance (total) */
    uint16_t u13MinSpeed              : 13;                                     /**< 0x06.[12: 0]: Minimum speed (0 ... 8191) */
    uint16_t u3MicroSteps             : 3;                                      /**< 0x06.[15:13]: Number of micro-steps: 2^n (or 1 << n); 0 = Full-steps */
    uint16_t u16Speed_1;                                                        /**< 0x08: Speed_1 */
    uint16_t u16Speed_2;                                                        /**< 0x0A: Speed_2 */
    uint16_t u16Speed_3;                                                        /**< 0x0C: Speed_3 */
#if (LINPROT != LIN2X_AIRVENT12)
    uint16_t u16Speed_4;                                                        /**< 0x0E: Speed_4 */
#else  /* (LINPROT != LIN2X_AIRVENT12) */
    uint16_t u16TorqueSpeed;                                                    /**< 0x0E: Torque-mode Speed */
#endif /* (LINPROT != LIN2X_AIRVENT12) */
    uint16_t u16AccelerationConst;                                              /**< 0x10: Acceleration-constant */
    uint16_t u3AccelerationSteps      : 3;                                      /**< 0x12.[2:0]: Acceleration-(u)Steps */
    uint16_t u3DecelerationSteps      : 3;                                      /**< 0x12.[5:3]: Deceleration-(u)Steps */
    uint16_t u2MotorCurrentMultiplier : 2;                                      /**< 0x12.[7:6]: Motor current multiplier: 1, 2, 4 or 8 */
    uint16_t u8HoldingTorqueCurrent   : 8;                                      /**< 0x13: Holding Torque current threshold */
    uint16_t u8RunningTorqueCurrent   : 8;                                      /**< 0x14: Running Torque current threshold */
    uint16_t u4TorqueBoost1           : 4;                                      /**< 0x15.[3:0]: TorqueBoost1 (5%) -25%..50% */
    uint16_t u4TorqueBoost2           : 4;                                      /**< 0x15.[7:4]: TorqueBoost2 (5%)   0%..75% */
    uint16_t u8PidCoefP               : 8;                                      /**< 0x16: Speed PID-Coefficient P */
    uint16_t u8PidCoefI               : 8;                                      /**< 0x17: Speed PID-Coefficient I */
    uint16_t u8PidCoefD               : 8;                                      /**< 0x18: Speed PID-Coefficient D */
    uint16_t u8PidStartupOrLowerHoldingLimit : 8;                               /**< 0x19: Startup-current limit/PID Lower-limit Holding (output) */
    uint16_t u8PidLowerLimit          : 8;                                      /**< 0x1A: PID Lower-limit (output) */
    uint16_t u8PidUpperLimit          : 8;                                      /**< 0x1B: PID Upper-limit (output) */
    uint16_t u7PidCtrlPeriod          : 7;                                      /**< 0x1C.[6:0]: PID running control-period */
    uint16_t u1PidPeriodTimeOrSpeed   : 1;                                      /**< 0x1C.[7]: PID Period is speed or Time based */
    uint16_t u8AppOT                  : 8;                                      /**< 0x1D: Application Over-Temperature [C] */
    uint16_t u8AppUV                  : 8;                                      /**< 0x1E: Application Under-voltage level [1/8V] */
    uint16_t u8AppOV                  : 8;                                      /**< 0x1F: Application Over-voltage level [1/8V] */
#if defined (__MLX81339__)
    uint16_t u16Inductance;                                                     /**< 0x20: Coil Inductance [uH] */
    uint16_t u8RampUpSpeedLimit       : 8;                                      /**< 0x22: Ramp-up Speed Limit */
    uint16_t u8RampDownSpeedLimit     : 8;                                      /**< 0x23: Ramp-down Speed Limit */
    uint16_t u3ChipUV                 : 3;                                      /**< 0x24: Chip Under Voltage */
    uint16_t u2ChipOV                 : 2;                                      /**< 0x24: Chip Over Voltage */
    uint16_t u3Reserved               : 3;                                      /**< 0x24: Reserved */
    uint16_t u8AlignmentSpeed         : 8;                                      /**< 0x25: Alignment Speed */
    uint16_t u16Reserved;                                                       /**< 0x26: Reserved */
#endif /* defined (__MLX81339__) */
} ACT_PARAMS_t;

#if (_SUPPORT_TRIAXIS_MLX90363 != FALSE) || (_SUPPORT_TRIAXIS_MLX9038x != FALSE) || \
    (_SUPPORT_TRIAXIS_MLX90367 != FALSE) || (_SUPPORT_TRIAXIS_MLX90372 != FALSE) || \
    (_SUPPORT_TRIAXIS_MLX90377 != FALSE) || (_SUPPORT_TRIAXIS_MLX90395 != FALSE) || \
    (_SUPPORT_TRIAXIS_MLX90421 != FALSE) || (_SUPPORT_TRIAXIS_MLX90422 != FALSE) || \
    (_SUPPORT_TRIAXIS_MLX90425 != FALSE) || (_SUPPORT_TRIAXIS_MLX90426 != FALSE) || \
    (_SUPPORT_TRIAXIS_MLX90427 != FALSE) || \
    (_SUPPORT_INDUCTIVE_POS_SENSOR_MLX90513 != FALSE) || \
    (_SUPPORT_DUAL_HALL_LATCH_MLX92251 != FALSE) || (_SUPPORT_DUAL_HALL_LATCH_MLX92255 != FALSE) || \
    (_SUPPORT_FOC_MODE != FOC_MODE_NONE)
/*! 6) SENSOR: 1 block  of 64-bits (4x 16-bits words) */
typedef struct
{
    uint16_t u8CRC8                   : 8;                                      /**< 0x00: CRC8 */
    uint16_t u4SensorType             : 4;                                      /**< 0x01[3:0]: Sensor-type */
#define C_SENSOR_MLX90363               1U                                      /*!< Triaxis with SPI; 4-wire interface; 3.3V */
#define C_SENSOR_MLX90380               2U                                      /*!< Resolver; 2-wire-analogue; 3.3V */
#define C_SENSOR_MLX90381               2U                                      /*!< Resolver; 2-wire-analogue; 3.3V */
#define C_SENSOR_MLX92251               3U                                      /*!< Dual Hall-Latch; 2-wire interface; 3.3V */
#define C_SENSOR_MLX92255               4U                                      /*!< Dual Hall-Latch; 2-wire interface; 3.3V */
#define C_SENSOR_MLX90367               5U                                      /*!< Triaxis with SENT; 1-wire interface; 5.0V */
#define C_SENSOR_MLX90372               5U                                      /*!< Triaxis with SENT; 1-wire interface; 5.0V */
#define C_SENSOR_MLX90421               6U                                      /*!< Triaxis with PWM; 1-wire interface; 5.0V */
#define C_SENSOR_MLX90377               7U                                      /*!< Triaxis with SENT/SPC; 1-wire interface; 5.0V */
#define C_SENSOR_MLX90513               8U                                      /*!< Inductive Position Sensor with SENT/SPC/PWM; 1-wire interface; 5.0V */
#define C_SENSOR_MLX90395               9U                                      /*!< Triaxis with SPI; 4-wire interface; 3.3V */
#define C_SENSOR_MLX90422               10U                                     /*!< Triaxis with SENT; 1-wire interface; 5.0V */
#define C_SENSOR_MLX90425               11U                                     /*!< Triaxis with PWM; 1-wire interface; 5.0V */
#define C_SENSOR_MLX90426               12U                                     /*!< Triaxis with SENT; 1-wire interface; 5.0V */
#define C_SENSOR_MLX90427               13U                                     /*!< Triaxis with SPI; 4-wire interface; 3.3V */
#define C_SENSOR_FOC                    15U                                     /*!< FOC */
    uint16_t u3Reserved               : 3;                                      /**< 0x01[6:4]: Reserved */
    uint16_t u1CDI                    : 1;                                      /**< 0x01[7]: CDI On/Off */
#if (_SUPPORT_TRIAXIS_MLX90363 != FALSE) || (_SUPPORT_TRIAXIS_MLX9038x != FALSE) || \
    (_SUPPORT_TRIAXIS_MLX90367 != FALSE) || (_SUPPORT_TRIAXIS_MLX90372 != FALSE) || \
    (_SUPPORT_TRIAXIS_MLX90377 != FALSE) || (_SUPPORT_TRIAXIS_MLX90395 != FALSE) || \
    (_SUPPORT_TRIAXIS_MLX90421 != FALSE) || (_SUPPORT_TRIAXIS_MLX90422 != FALSE) || \
    (_SUPPORT_TRIAXIS_MLX90425 != FALSE) || (_SUPPORT_TRIAXIS_MLX90426 != FALSE) || \
    (_SUPPORT_TRIAXIS_MLX90427 != FALSE) || \
    (_SUPPORT_DUAL_HALL_LATCH_MLX92251 != FALSE) || (_SUPPORT_DUAL_HALL_LATCH_MLX92255 != FALSE)
    uint16_t u8TriaxisOffsetX         : 8;                                      /**< 0x02: Triaxis Offset X */
    uint16_t u8TriaxisOffsetY         : 8;                                      /**< 0x03: Triaxis Offset Y */
    uint16_t u4TriaxisMagnetPolePairs : 4;                                      /**< 0x04.[3:0]: Triaxis Magnet Pole Pairs */
    uint16_t u11TriaxisAmplitudeCorrection : 11;                                /**< 0x04.[14:4]: Triaxis X/Y-amplitude correction */
    uint16_t u1TriaxisDirection       : 1;                                      /**< 0x04.[15]: Triaxis Direction (0 = same as Act; 1 = Reverse) */
    uint16_t u16TriaxisAngleOffset;                                             /**< 0x06: Triaxis Angle Offset */
#elif (_SUPPORT_INDUCTIVE_POS_SENSOR_MLX90513 != FALSE)
    uint16_t u8ReservedX              : 8;                                      /**< 0x02: Reserved X */
    uint16_t u8ReservedY              : 8;                                      /**< 0x03: Reserved Y */
    uint16_t u4Reserved               : 4;                                      /**< 0x04.[3:0]: Reserved */
    uint16_t u11Reserved              : 11;                                     /**< 0x04.[14:4]: Reserved */
    uint16_t u1TriaxisDirection       : 1;                                      /**< 0x04.[15]: Triaxis Direction (0 = same as Act; 1 = Reverse) */
    uint16_t u16TriaxisAngleOffset;                                             /**< 0x06: Triaxis Angle Offset */
#elif (_SUPPORT_FOC_MODE != FOC_MODE_NONE)
    uint16_t u8PidCoefP_LA            : 8;                                      /**< 0x02: PID Coefficient P for Load-angle */
    uint16_t u8PidCoefI_LA            : 8;                                      /**< 0x03: PID Coefficient I for Load-angle */
    uint16_t u8PidCoefD_LA            : 8;                                      /**< 0x04: PID Coefficient D for Load-angle */
    uint16_t u8TargetLA               : 8;                                      /**< 0x05: Target Load-Angle */
    uint16_t u4StallLA_Threshold      : 4;                                      /**< 0x06: Stall-detector "LA" angle-threshold (5 degrees) (MMP220720-1) */
    uint16_t u4StallLA_Width          : 4;                                      /**< 0x06: Stall-detector "LA" width (MMP220720-1) */
    uint16_t u3OpenToCloseAmplitude   : 3;                                      /**< 0x07[2:0]: Open-to-Close amplitude factor */
    uint16_t u5StallSpeed_Threshold   : 5;                                      /**< 0x07[7:3]: Stall-detector "Speed" threshold */
#endif
#if FALSE /* Enhanced */
    uint16_t u8ReservedA              : 8;                                      /**< 0x08: Reserved A */
    uint16_t u8ReservedB              : 8;                                      /**< 0x09: Reserved A */
    uint16_t u8PidCoefP_IPK_IQ        : 8;                                      /**< 0x0A: PID Coefficient P for Load-angle */
    uint16_t u8PidCoefI_IPK_IQ        : 8;                                      /**< 0x0B: PID Coefficient I for Load-angle */
    uint16_t u8PidCoefD_IPK_IQ        : 8;                                      /**< 0x0C: PID Coefficient D for Load-angle */
    uint16_t u8PidCoefP_ID            : 8;                                      /**< 0x0D: PID Coefficient P for Load-angle */
    uint16_t u8PidCoefI_ID            : 8;                                      /**< 0x0E: PID Coefficient I for Load-angle */
    uint16_t u8PidCoefD_ID            : 8;                                      /**< 0x0F: PID Coefficient D for Load-angle */
#endif
} SENSOR_t;
#endif /* (_SUPPORT_TRIAXIS_MLX90363 != FALSE) || (_SUPPORT_TRIAXIS_MLX9038x != FALSE) || \
        * (_SUPPORT_TRIAXIS_MLX90367 != FALSE) || (_SUPPORT_TRIAXIS_MLX90372 != FALSE) || \
        * (_SUPPORT_TRIAXIS_MLX90377 != FALSE) || (_SUPPORT_TRIAXIS_MLX90395 != FALSE) || \
        * (_SUPPORT_TRIAXIS_MLX90421 != FALSE) || (_SUPPORT_TRIAXIS_MLX90422 != FALSE) || \
        * (_SUPPORT_TRIAXIS_MLX90425 != FALSE) || (_SUPPORT_TRIAXIS_MLX90426 != FALSE) || \
        * (_SUPPORT_TRIAXIS_MLX90427 != FALSE) || \
        * (_SUPPORT_INDUCTIVE_POS_SENSOR_MLX90513 != FALSE) || \
        * (_SUPPORT_DUAL_HALL_LATCH_MLX92251 != FALSE) || (_SUPPORT_DUAL_HALL_LATCH_MLX92255 != FALSE) || \
        * (_SUPPORT_FOC_MODE != FOC_MODE_NONE) */

/*! 7) ACT_STALL: 1 block  of 64-bits (4x 16-bits words) (MMP190412-1) */
typedef struct
{
    uint16_t u8CRC8                   : 8;                                      /**< 0x00: CRC8 */
    uint16_t u7StallA_Threshold       : 7;                                      /**< 0x01.[6:0]: Stall-detector "A" Threshold (Amplitude) */
    uint16_t u1StallA_Ena             : 1;                                      /**< 0x01.[7]: Stall-detector "A" Enable */
    uint16_t u4StallA_Width           : 4;                                      /**< 0x02.[3:0]: Stall-detector "A" Width */
    uint16_t u4StallO_Width           : 4;                                      /**< 0x02.[3:0]: Stall-detector "O" Width */
    uint16_t u7StallO_Threshold       : 7;                                      /**< 0x03.[6:0]: Stall-detector "O" Threshold (Oscillation) */
    uint16_t u1StallO_Ena             : 1;                                      /**< 0x03.[7]: Stall-detector "O" Enable */
    uint16_t u7StallS_Threshold       : 7;                                      /**< 0x04.[6:0]: Stall-detector "S" Threshold (Speed) */
    uint16_t u1StallS_Ena             : 1;                                      /**< 0x04.[7]: Stall-detector "S" Enable */
    uint16_t u4StallS_Width           : 4;                                      /**< 0x05.[3:0]: Stall-detector "S" Width */
    uint16_t u1RestallPor             : 1;                                      /**< 0x05.[4]: Re-stall after POR disable/enable */
    uint16_t u1StallSpeedDepended     : 1;                                      /**< 0x05.[5]: Stall speed depended */
    uint16_t u2Reserved               : 2;                                      /**< 0x05.[7:6]: Reserved */
    uint16_t u8RewindSteps            : 8;                                      /**< 0x06: Rewind full steps */
    uint16_t u8StallDetectorDelay     : 8;                                      /**< 0x07: Stall detector delay */
#if FALSE /* Enhanced */
    uint16_t u7StallP_Threshold       : 7;                                      /**< 0x08.[6:0]: Stall-detector "P" Threshold (Position) */
    uint16_t u1StallP_Ena             : 1;                                      /**< 0x08.[7]: Stall-detector "P" Enable */
    uint16_t u4StallP_Width           : 4;                                      /**< 0x09.[3:0]: Stall-detector "P" Width */
    uint16_t u4Reserved               : 4;                                      /**< 0x09.[7:4]: Reserved */
    uint16_t u16ReservedA;                                                      /**< 0x0A: Reserved A */
    uint16_t u16ReservedB;                                                      /**< 0x0C: Reserved B */
    uint16_t u16ReservedC;                                                      /**< 0x0E: Reserved C */
#endif
} ACT_STALL_t;
#define C_STALL_THRESHOLD_SDIV        7U                                        /*!< Stall-threshold shift-divider */
#define C_STALL_THRESHOLD_DIV         (1 << C_STALL_THRESHOLD_SDIV)             /*!< Stall-threshold divider */

#if (_SUPPORT_NV_LOG_ERROR != FALSE)
/*! 8) APP_LOG: 2 block  of 64-bits (8x 16-bits words) */
typedef struct
{
    uint8_t u8LogIdx;                                                           /**< Application Log write-index */
    uint8_t au8LogData[15];                                                     /**< Application Log array */
} APP_LOG_t;
#endif /* (_SUPPORT_NV_LOG_ERROR != FALSE) */

#if (I2C_COMM != FALSE)
/*! 9) STD_I2C_PARAMS_t: 1 block of 64-bits of I2C parameters */
typedef struct
{
    uint16_t u8CRC8                   : 8;                                      /*!< 0x00: CRC8 */
    uint16_t u8Address                : 8;                                      /*!< 0x01: Slave Address */
    uint16_t u16ReservedA;                                                      /*!< 0x02: Reserved A */
    uint16_t u16ReservedB;                                                      /*!< 0x04: Reserved B */
    uint16_t u16ReservedC;                                                      /*!< 0x06: Reserved C */
} STD_I2C_PARAMS_t;
#endif /* (I2C_COMM != FALSE) */

#if (CAN_COMM != FALSE)
/*! 9) STD_CAN_PARAMS_t: 2 block of 64-bits of CAN parameters */
typedef struct
{
    uint16_t u8CRC8                   : 8;                                      /**< 0x00: CRC8 */
    uint16_t u8Baudrate               : 8;                                      /**< 0x01: CAN Baudrate */
    uint16_t u8StatusPeriod           : 8;                                      /**< 0x02: CAN Status Period */
    uint16_t u8FDBaudrate             : 8;                                      /**< 0x03: CAN FD Baudrate */
    uint16_t u16IdInLSW;                                                        /**< 0x04: CAN-in ID (LSW) */
    uint16_t u16IdInMSW;                                                        /**< 0x06: CAN-in ID (MSW) */
    uint16_t u16IdOutLSW;                                                       /**< 0x08: CAN-out ID (LSW) */
    uint16_t u16IdOutMSW;                                                       /**< 0x0A: CAN-out ID (MSW) */
    uint16_t u16ReservedB;                                                      /**< 0x0C: Reserved B */
    uint16_t u16ReservedC;                                                      /**< 0x0E: Reserved C */
} STD_CAN_PARAMS_t;
#endif /* (CAN_COMM != FALSE) */

/*! x) BOOTLOADER PARAMS: 1 block of 64-bits (4x 16-bits words) */
typedef struct
{
    uint16_t u16ReservedA;                                                      /**< 0x00: Reserved A */
    uint16_t u16ReservedB;                                                      /**< 0x02: Reserved B */
    uint16_t u16ReservedC;                                                      /**< 0x04: Reserved C */
    uint16_t u8Address                : 8;                                      /**< 0x06: Slave Address */
    uint16_t u8CRC                    : 8;                                      /**< 0x07: Reserved for CRC (not used) */
} BOOTLOADER_PARAMS_t;

/*! user-application structure Non Volatile Memory */
typedef struct
{
    HEADER_t hdr;                                                               /**< 1) header */
#if (LIN_COMM != FALSE)
    STD_LIN_PARAMS_t stdlin[2];                                                 /**< 2a) Standard LIN parameters */
#if (LINPROT == LIN2X_HVAC52)
    ENH_LIN_PARAMS_t enhlin[2];                                                 /**< 2b) Enhanced LIN parameters */
#endif /* (LINPROT == LIN2X_HVAC52) */
#if (_SUPPORT_UDS != FALSE)
    UDS_LIN_PARAMS_t uds;                                                       /**< 2c) UDS Data */
#endif /* (_SUPPORT_UDS != FALSE) */
#endif /* (LIN_COMM != FALSE) */
    APP_EOL_t eol;                                                              /**< 3) Application EOL parameters */
#if (_SUPPORT_APP_SAVE != FALSE)
